---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamAssetLibId
source: html/ffbddd87-8c48-78a1-34d1-5d073861751f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamAssetLibId Property

"Asset library id"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialAssetParamAssetLibId { get; }
```